Revit 2027 API
GroupTypeId.RailingSystemFamilySegmentPattern Property
 Segment Pattern (default).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingSystemFamilySegmentPattern { get; }
Public Shared ReadOnly Property RailingSystemFamilySegmentPattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingSystemFamilySegmentPattern {
	ForgeTypeId^ get ();
}
static member RailingSystemFamilySegmentPattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace